Revit 2024 API
FileExportingEventArgs Properties
The FileExportingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPreDocEventArgs.)
Format
 Identifies the export format, e.g. DWG or image.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Path
 The target path for the export.
See Also
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace